In [1]:
import numpy as np
import pandas as pd

1. Create a dictionary named 'europe_dict' which has names of countries in europe, their capital and their population.
Country	Capital	Population
Spain	Madrid	46.77
France	Paris	66.03
Germany	Berlin	80.62
Norway	Oslo	5.084

In [2]:
europe_dict={'Country':['Spain','France','Germany','Norway'],'Capital':['Madrid','Paris','Berlin','Oslo'],'Population':[46.77,66.03,80.62,5.084]}

In [4]:
europe_dict

{'Country': ['Spain', 'France', 'Germany', 'Norway'],
 'Capital': ['Madrid', 'Paris', 'Berlin', 'Oslo'],
 'Population': [46.77, 66.03, 80.62, 5.084]}

In [5]:
df1=pd.DataFrame(europe_dict)

In [6]:
df1

   Country Capital  Population
0    Spain  Madrid      46.770
1   France   Paris      66.030
2  Germany  Berlin      80.620
3   Norway    Oslo       5.084

2. In the data in question 1, add a new column 'FamousFor'. The column tells what each country is famous for.

In [7]:
df1['Famous For']=['Football','Eiffel Tower','Cars','Midnight Sun']

In [8]:
df1

   Country Capital  Population    Famous For
0    Spain  Madrid      46.770      Football
1   France   Paris      66.030  Eiffel Tower
2  Germany  Berlin      80.620          Cars
3   Norway    Oslo       5.084  Midnight Sun

3. Use the data created in question 1, to do the following:
1. Access column 'Captial' by specifying the column number.
2. Access column 'Population' by specifying the column name.
3. Access a country information

In [14]:
df1.iloc[:,1]

0    Madrid
1     Paris
2    Berlin
3      Oslo
Name: Capital, dtype: object

In [16]:
df1.loc[:,'Population']

0    46.770
1    66.030
2    80.620
3     5.084
Name: Population, dtype: float64

In [24]:
df1.iloc[0:5,0:]

   Country Capital  Population    Famous For
0    Spain  Madrid      46.770      Football
1   France   Paris      66.030  Eiffel Tower
2  Germany  Berlin      80.620          Cars
3   Norway    Oslo       5.084  Midnight Sun

	
6. Create a pandas series having values 4, 7, -5, 3, NAN and their index as d, b, a, c, e

In [36]:
ser=pd.Series([4,7,-5,3,np.NAN],index=['d','b','a','c','e'])

In [37]:
ser

d    4.0
b    7.0
a   -5.0
c    3.0
e    NaN
dtype: float64

7. Using the series in question 6, find:
the minimum of all values
the maximum of all value

In [38]:
min(ser)

-5.0

In [39]:
max(ser)

7.0

8. Using the series in question 6, sort:
the values in ascending order
the values in decending order

In [40]:
ser.sort_values()

a   -5.0
c    3.0
d    4.0
b    7.0
e    NaN
dtype: float64

In [42]:
ser.sort_values(ascending=False)

b    7.0
d    4.0
c    3.0
a   -5.0
e    NaN
dtype: float64

9.. Import dataset 'flights' from library seaborn. Print the first 10 rows and last 20 rows of the data set.

In [46]:
import seaborn as sns

In [47]:
flight=sns.load_dataset('flights')

In [50]:
flight.head(10)

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121
5  1949   Jun         135
6  1949   Jul         148
7  1949   Aug         148
8  1949   Sep         136
9  1949   Oct         119

In [52]:
flight.tail(20)

     year month  passengers
124  1959   May         420
125  1959   Jun         472
126  1959   Jul         548
127  1959   Aug         559
128  1959   Sep         463
129  1959   Oct         407
130  1959   Nov         362
131  1959   Dec         405
132  1960   Jan         417
133  1960   Feb         391
134  1960   Mar         419
135  1960   Apr         461
136  1960   May         472
137  1960   Jun         535
138  1960   Jul         622
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

10. Import dataset 'iris' from library seaborn. Check for datatypes of all variable.

In [53]:
iris=sns.load_dataset('iris')

In [54]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [56]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB